Repository: mozilla-l10n/mt-training-data
Catalog: ha/ha_pontoon.tmx
Source language: en_us
Languages: ha

source: 2019 End-of-Year Release
ha: Sakin-karshen Shekarar 2019

source: 2 down, keep it up!<playIcon></playIcon>
ha: 2 ƙasa, ci gaba da aiki mai kyau! <playIcon> </playIcon>

source: ≥ 2 No votes
ha: ƙuri'ar a'a 2 ko fiye da haka

source: ≥ 2 Yes votes
ha: ƙuri'ar ƙwarai 2 ko fiye da haka

source: Abkhaz
ha: Abkhazian

source: About
ha: Gameda mu

source: Accent
ha: Karin harshe

source: Account
ha: Asusu

source: { $actionType }<playIcon></playIcon> did they accurately speak the sentence?
ha: { $actionType }<playIcon></playIcon> Ko sunyi magana daidai?

source: { $actionType }<recordIcon></recordIcon> then read the sentence aloud
ha: { $actionType }<recordIcon></recordIcon> sai a karanta jimlar da murya mai ƙarfi

source: { $actionType }<stopIcon></stopIcon> when done
ha: { $actionType } <stopIcon> </stopIcon> lokacin da aka aikata

source: { $actionType } submit when ready
ha: { $actionType } aika in ka gama

source: Add an avatar to your profile
ha: Ɗora hoto akan profile ɗinka.

source: Additional Language
ha: Ƙarin Harshe

source: Add Language
ha: Ƙara Yare

source: Add Your Voice
ha: Ƙara Muryar ka

source: Afrikaans
ha: Afirkanci

source: Age
ha: Shekaru

source: Albanian
ha: Yaren Albaniya

source: All
ha: Duka

source: All voice clips in the dataset are scrubbed of personally identifying information. When a contributor provides demographic data via their profile, that information is de-identified from their voice clips before being bundled for download in the dataset and is never made public on their profile page.
ha: Duk shirye-shiryen muryoyi a cikin bayanan an goge bayanan ganowa da kaina. Lokacin da mai ba da gudummawa ya ba da bayanan alƙaluma ta hanyar bayanin su, ana bayyana bayanin daga shirye-shiryen muryar su kafin a haɗa su don zazzagewa a cikin bayanan kuma ba a taɓa sanar da su a shafin su na asali ba.

source: Amharic
ha: Amharik

source: Anonymized user data like age, gender, and accent helps improve the audio data used to train the accuracy of speech recognition engines. Your username and email will never be associated with your submitted data, and you can choose whether to make your username public or anonymous.
ha: Tsare sirrin mai anfani da labarai kaman shekara, jinsi, da taimaka wa tushin domin ƙarfafa labaran muryar wadda akayi anfani da shi domin horas da ingin gano magana. Sunan mai anfani da imel baza'a taɓa danganta shi da labarin da ka bayar ba, da zaka iya zaɓin ko ka sunanka a fili ko a asirce.

source: Arabic
ha: Larabci

source: Armenian
ha: Armeniyawa

source: Armenian Western
ha: Yammacin Armeniya

source: Assamese
ha: Yaren Assam

source: Asturian
ha: Yan Asturian

source: Audio Format
ha: Tsarin bidiyo

source: Avatar
ha: Hoto

source: Average
ha: Matsakaici

source: A voice clip is marked "valid" when a user gives it a Yes vote.
ha: Ana alamta naɗin murya a matsayin mai kyau idan mai amfani ya bashi ƙuri'a ta ƙwarai.

source: Awards
ha: Lambobin yabo

source: Azerbaijani
ha: Yaren Azerbaijani

source: Back
ha: Baya

source: Back to Top
ha: Koma zuwa sama

source: Bambara
ha: Yaren Bambara

source: Basaa
ha: Yaren basaa

source: Bashkirs
ha: Yaren Bashkirs

source: Basque
ha: Yaren Basque

source: Become a partner
ha: Zamo abokin hulɗa

source: Belarusian
ha: Yan Belarus

source: Benefits
ha: Amfani

source: Bengali
ha: Yaren Bengalinci

source: <bold>{ $count }</bold> Clips
ha: <bold>{ $count }</bold> shirye-shiryen bidiyo

source: <bold>Help us</bold> find more voices
ha: <m> Taimaka mana </ m> sami karin muryoyi

source: Both
ha: Duka biyu

source: Both of these projects are part of our efforts to bridge the digital speech divide. Voice recognition technologies bring a human dimension to our devices, but developers need an enormous amount of voice data to build them. Currently, most of that data is expensive and proprietary. We want to make voice data freely and publicly available, and make sure the data represents the diversity of real people. Together we can make voice recognition better for everyone.
ha: Duk waɗannan ayyukan ɗayan ɓangare ne na ƙoƙarinmu don haɓaka rabe-raben magana na dijital. Fasahar gane murya tana kawo girman mutum zuwa ga na'urorinmu, amma masu haɓaka suna buƙatar adadi mai yawa na bayanan murya don gina su. A halin yanzu, yawancin waɗannan bayanan suna da tsada da kuma mallakar mallaka.¶ Muna son samar da bayanan murya kyauta kuma a bayyane, kuma tabbatar da cewa bayanan suna wakiltar bambancin mutane na ainihi. Tare za mu iya fahimtar murya da kyau ga kowa.

source: Both (Speak and Listen)
ha: Dukansu (yi magana da Saurara)

source: Breton
ha: Yaren Breton

source: Browse Languages
ha: Binciko Yaruka

source: Build a custom goal
ha: Gina burin al'ada

source: Build Profile
ha: Gina Bayananka

source: Bulgarian
ha: Yan Bulgaria

source: Burmese
ha: Yaren Burmesa

source: Buryat
ha: Yaren Buryat

source: <b>Why an email?</b> We may need to contact you in the future about changes to the dataset, an email provides us a point of contact.
ha: <b> Me yasa imel? </b> Muna iya buƙatar tuntuɓar ku a nan gaba game da canje-canje ga tsarin bayanan, imel ɗin yana ba mu wurin tuntuɓarmu.

source: By editing your goal, you may lose your existing progress.
ha: Ta hanyar gyara burinka, zaka iya rasa ci gaban da kuke ciki.

source: By opting in to receive emails you state that you are okay with Mozilla handling this info as explained in Mozilla’s <privacyLink>Privacy Policy</privacyLink>.
ha: Akan zaɓin ƙarban sakonnin imel ka shaida cewa ka amince da Mozilla su rike wannan labari kamar yadda aka bayyana a tsarin <privacyLink>sirrin tsaruka</privacyLink>.

source: By opting in to receive emails you state that you are okay with Mozilla handling this info as explained in Mozilla’s <privacyLink>Privacy Policy<privacyLink>.
ha: Ta hanyar shigar da kanka don samun saƙonnin yanar gizo ka yadda cewa Mozilla suna kula da bayanai kamar yada suka bayyana a <privacyLink> Tsarin Gudanar da sirrinsu <privacyLink>

source: <b>You agree</b> to not attempt to determine the identity of speakers in the Common Voice dataset
ha: <b>Ka amince</b> kaƙi sanin tushin mai magana a tarin Common Voice

source: By providing some information about yourself, the audio data you submit to Common Voice will be more useful to Speech Recognition engines that use this data to improve their accuracy.
ha: Idan ka ba da bayanai a kanaka, muryar da ka tura zuwa Common Voice za ta fi amfani da fasahar tantance muryaya kuma zai taimaka matuka don samarda sakamako mai kyau.

source: By using Common Voice, you agree to our <termsLink>Terms</termsLink> and <privacyLink>Privacy Notice</privacyLink>
ha: Ta anfani da Common Voice, ka amince da <termsLink>Sharruɗan mu</termsLink> da <privacyLink>Bayanan sirri</privacyLink>

source: CANCEL
ha: Soƙe

source: Cancel Re-recording
ha: Katse naɗin

source: Cancel Submission
ha: Soke Turawa

source: Can't decide?
ha: Ba za a iya yanke shawara ba?

source: Cantonese
ha: Yaren Cantonese

source: Catalan
ha: Yaren Katalanci

source: Central Kurdish
ha: Kurdish ta tsakiya

source: Change your email via Settings under Login Identity
ha: Ka sauya imel ɗinka ta cikin saituna ƙarƙashin shaidar shiga

source: Chinese (China)
ha: Cinanci (Sin)

source: Chinese (Hong Kong)
ha: Yaren chananci (Hong Kong)

source: Chinese (Taiwan)
ha: Yaren chananci (Taiwan)

source: Chuvash
ha: Yaren Chuvash

source: Click
ha: Danna

source: Clips recorded
ha: Sautukan da aka naɗa

source: Clips Uploaded
ha: An ɗora Clips ɗin

source: Clips validated
ha: Sautukan da aka tantance

source: Clips You've Recorded
ha: Shirye-shiryen da Kukayi rikodi

source: Clips You've Validated
ha: Shashin bidiyon da ka inganta

source: Close
ha: Rufe

source: Collecting sentences from the public domain, or writing new ones for the public domain.
ha: Tattara jumloli daga yankin jama'a, ko rubuta sababbi don yankin jama'a.

source: Comment
ha: Sharhi

source: Common Voice data plus all other voice datasets above.
ha: Bayanan Common Voice tare da duk wasu bayanan bayanan murya a sama.

source: Common Voice Dataset
ha: Bayanan bayanai na Common Common

source: Common Voice is a collaborative project, and we're depending on our community of partners and contributors to build the largest open-source dataset of voices ever. We would like to thank the following people and organizations for their help with the project:
ha: Common Voice aiki ne na haɗin gwiwa, kuma mun dogara ne da ƙungiyar abokanmu da masu ba da gudummawa don gina babbar hanyar buɗe muryar bayanai ta murya koyaushe.¶ ¶ Zamu so mu gode wa mutane da kungiyoyi masu zuwa don taimakon su da aikin:

source: Common Voice is Mozilla's initiative to help teach machines how real people speak.
ha: Common Voice wani aiki ne na Moxilla don taimakawa Injuna gane yadda mutanen gaske suke magana

source: Common Voice is part of Mozilla's initiative to help teach machines how real people speak.
ha: Common Voice wani aiki ƙirƙira ne na Mozilla don taimakawa na'ura mai ƙwaƙwalwa gane yadda mutanen gaske suke magana.

source: Common Voice is part of Mozilla's initiative to help teach machines how real people speak. In addition to the Common Voice dataset, we’re also building an open source speech recognition engine called Deep Speech.
ha: Common Voice na daga cikin ƙudirin Mozilla don taimakawa koyar da injuna yadda ainihin mutane ke magana. Baya ga kundin bayanan Common Voice, muna kuma gina wani injin buɗe magana wanda ake kira Deep Speech.

source: Common Voice is the world’s largest publicly available, multi-language voice dataset.
ha: Murya ta gama gari ita ce mafi girma a duniya wacce take a fili, dataset na murya da yare da yawa.

source: Common Voice recordings are used by academics, small businesses, and voice recognition enthusiasts to help train and grow publicly available resources like voice models. Can you let us know why you would like your recordings deleted?
ha: Muryoyin da aka ɗauka a Common Voice za a iya amafani da su don Harkar ilimi, ko ƙananan sana'o'i da kuma masu shawa'awar fasahar murya don su taimaka wajen horaswa da kuma bunƙasa baynai na fili kamar manhajar murya. Za ka iya gaya mana me yasa ka ke son goge muryoyinka da aka ɗauka?

source: Confirm Goal
ha: Tabbatar da manufa

source: Connect with Gravatar
ha: Haɗa tare da Gravatar

source: Contact
ha: Tuntuɓi

source: Contact Form
ha: Tuntuɓemu

source: Content available under a <licenseLink>Creative Commons license</licenseLink>
ha: Ana iya samun bayanan nan a ƙarƙashin tsarin <licenseLink>Creative Commons license</licenseLink>

source: Continue
ha: Ci gaba

source: Contribute
ha: Taimaka

source: Contribute sentences
ha: Ba da gudummawar jimloli

source: Contribute to { $lang }
ha: Taimaka wa { $lang }

source: Contribute Your Voice
ha: Taimaka da Muryarka

source: Contribution Activity
ha: Ayyukan Gudummawa

source: Contribution Experience
ha: Ƙwarewa kan Taimako

source: Contributors record voice clips by reading from a bank of donated sentences.
ha: Masu ba da gudummawa suna yin rikodin shirye-shiryen murya ta hanyar karatu daga bankin jumla da aka bayar.

source: Cookies
ha: Kukis

source: Cornish
ha: Yaren Cornish

source: Corsican
ha: Yaren Corsican

source: { $count } clips
ha: { $count } Shashin bidiyoyi

source: { $count }mo
ha: watanni { $count }

source: { $count }wk
ha: sati { $count }

source: { $count }y
ha: Shekaru { $count }

source: Create a Custom Goal
ha: Ƙirƙiri Manufar Al'ada

source: Create a voice clip as part of your profile avatar. Others will be able to hover and listen to your clip.
ha: Ƙirkiri shashin murya a zaman ɓangaren bayaninka na avatar. Kowa zasu iya shawagi ku su saurari shirinka.

source: Croatian
ha: Yaren Kuroshiya

source: Czech
ha: Yaren Cek

source: Daily Goal
ha: Burin yau da kullun

source: Danish
ha: Yaren Danish

source: Datasets
ha: Tuƙullumar Bayanai

source: Date
ha: Kwanan Wata

source: Days
ha: Kwanaki

source: De-identified
ha: Sake ganowa

source: DELETE
ha: GOGE

source: Delete my recordings
ha: Goge naɗe-naɗe na

source: Delete Profile
ha: Cire Bayananka

source: Dhivehi
ha: Yaren Dhivehi

source: Different language
ha: Yare daban

source: Difficult
ha: Wuya

source: Difficult to pronounce
ha: Wuya wajen furtawa

source: Donate your voice
ha: Ba da gudumuwar muryarka

source: Don't see your language on Common Voice yet?
ha: Ba kaga Yaren kaba a Common Voice ba har yanzu?

source: Don’t see your language reflected in the Dataset? To request a language head over to our Languages page.
ha: Shin, ba ku ga yarenku yana bayyana a cikin Dataset ba? Don neman shugaban harshe zuwa shafin Harsunanmu.

source: Download
ha: Sauke

source: Download Common Voice Data
ha: Sauke bayanan Common Voice

source: Download Data
ha: Sauke Bayanai

source: Download Dataset Bundle
ha: Sauke dunƙulen bayanai (dataset)

source: Download { $language }
ha: Ɗakko { $language }

source: Download My Data
ha: Sakko da Bayanaina

source: Download the Single Word Target Segment
ha: Zazzage Yankin Haɗafin Kalma Guda

source: Do you have ideas on how we can make the Common Voice dataset better? Let us know on Discourse
ha: Shin kana da dabaru kan yadda zamu inganta bayanan dattijan Murya mafi kyau? Bari mu sani akan Magana

source: Do you want to continue?
ha: Shin kana son ci gaba?

source: Do you want to Speak, Listen or both?
ha: Ko kana bukatan yin magana, Saurara ko duka biyu?

source: Drag and drop or <browseWrap>Browse</browseWrap>
ha: Jawo ka saka ko ka <browseWrap>Dakko</browseWrap>

source: During contribution submission feedback will be skipped after clicking 'Submit'. Contribution will continue directly with the next set of 5 recordings or validations.
ha: Lokacin mika gudumawar ra'ayi za'a tsallake shi bayan an danna ʻmika'. Gudumawar zai ci gaba kai tsaye tare da kashi na gaba na ɗaukar murya 5 ko ingancin aiki.

source: Dutch
ha: Yaren Dutch

source: Each entry in the dataset consists of a unique MP3 and corresponding text file. Many of the <b>{ $total }</b> recorded hours in the dataset also include demographic metadata like age, sex, and accent that can help train the accuracy of speech recognition engines. The dataset currently consists of <b>{ $valid }</b> validated hours in <b>{ $languages }</b> languages, but we’re always adding more voices and languages. Take a look at our <languagesLink>Languages page</languagesLink> to request a language or start contributing.
ha: Duk bayanan tsarreren da aka shigar na ɗauke da tsarin MP3 daban da sauran fayil. Yawa daga ciki <b>{ $total }</b> awannin naɗan murnya wanda ke cikin tsarin ya haɗar da shekara, Jinsi, da tushin mutum wanda zai taimaka horas da kwarewar magana ingi mai gano murya. The dataset currently consists of <b>{ $valid }</b> validated hours in <b>{ $languages }</b> languages, but we’re always adding more voices and languages. Take a look at our <languagesLink>Languages page</languagesLink> to request a language or start contributing.

source: Easy
ha: Sauƙi

source: Edit
ha: Gyara

source: Edit Profile
ha: Gyara Bayananka

source: Email
ha: imel

source: Email is already used for a different account
ha: Ana amfani da wannan imel ɗin a wani asusun na daban

source: Email Subscriptions
ha: Karɓar saƙonnin yanar gizo

source: English
ha: Turanci

source: Enter Email to Download
ha: Shigar da imel ɗinka don ka sauke

source: Enter email to send a sign up link
ha: Shigar da imel don aika hanyar haɗin rajista

source: Enter your email
ha: Shigar da adreshinka na yanar gizo

source: Error { $code }
ha: Kuskure { $code }

source: Erzya
ha: Yaren Erzya

source: Esperanto
ha: Yaren Esperanto

source: Estonian
ha: Yaren Istoniya

source: Everyone
ha: Kowane mutum

source: Exit & Delete clips
ha: Fita & share clips

source: FAQ
ha: Tambayoyin da aka fi tambaya

source: Faroese
ha: Yaren Faroese

source: Female
ha: Mace

source: Finish editing first?
ha: Kammala gyara da farko?

source: Finish recording
ha: Kammala Ɗaukar Murya

source: Finish recording first?
ha: Fara gama rikodin ɗin?

source: Finnish
ha: Yaren Finnish

source: For every voice clip donated, and every audio clip validated, your account dashboards are updated to reflect your latest progress in each language you contribute to. Yes, you can contribute to more than one!<br/><br/> Use dashboards to track your stats, see how you're doing alongside others in the community, and set daily or weekly contribution goals.
ha: Ga ko wane shashin bidiyon da aka bayar, da dukkan muryar da aka inganta, Assusun dashboard ɗinka an sabunta domin yin tafiya daidai da cingaba a kowani yaren da ka bada gudumawa. Eh, zaka iya bada gudumawa fiye da ɗaya!<br/><br/> yi anfani da dashboard domin farawa, gani yaya kake yi in aka kwatanta da sauran am'uma, da shirya burinka na yau da kullum ko gudumawarka na mako-mako.

source: For these launched languages the website has been successfully <localizationGlossaryLink>localized</localizationGlossaryLink>, and has enough <sentenceCollectionGlossaryLink>sentences collected</sentenceCollectionGlossaryLink> to allow for ongoing <speakLink>Speak</speakLink> and <listenLink>Listen</listenLink> contributions.
ha: Don waɗannan harsunan da aka ƙaddamar shafin yanar gizon ya sami nasarar <localizationGlossaryLink> a bayyane </localizationGlossaryLink>, kuma yana da isassun kalmomi <sentenceCollectionGlossaryLink> don tattarawa don ci gaba <speakLink> Magana </speakLink> da <saurareLink> / / > gudummawa.

source: French
ha: Faransanci

source: Frequently Asked Questions
ha: Tambayoyin da aka fi tambaya

source: Frisian
ha: Yaren Frisian

source: Fulah
ha: Filatanci

source: Galician
ha: Yaran Galician

source: Gender
ha: Jinsi

source: Georgian
ha: Yaren Jojiya

source: German
ha: Jamusanci

source: Get involved
ha: Sami Shiga

source: Get Involved
ha: Shiga a dama da kai

source: Get started with goals
ha: Fara farawa da maƙasudai

source: Get Started with Speech Recognition
ha: Fara da gane Managana (Speech Recognition)

source: Give your avatar a voice
ha: Ba wa muryarka avatar

source: Glossary
ha: Fihirisa

source: Goal reached
ha: An cimma Manufa

source: Goals
ha: Manufofi

source: Go to Discourse
ha: Je zuwa Discourse

source: Go to Languages Page
ha: Jeka zuwa shafin yaruka

source: Go to { $name }
ha: Je zuwa { $name }

source: Grammatical / spelling error
ha: Na magana/ kuskuren furta kalma

source: Great! How many clips a week?
ha: Da kyau! Shirye-shiryen bidiyo nawa a mako?

source: Great! How many clips per day?
ha: Da kyau! Shirye-shiryen bidiyo guda nawa a rana?

source: Great!<recordIcon></recordIcon> Record your next clip
ha: Da kyau!<recordIcon></recordIcon> Yi rikodin bidiyonku na gaba

source: Great work!<playIcon></playIcon> Listen again when you're ready
ha: Aiki mai kyau! <playIcon> </playIcon> sake saurara lokacin da kuka shirya

source: Greek
ha: Girkanci

source: Guarani
ha: Yaren Guarani

source: Hakha Chin
ha: Yan Hakha Cin

source: Have Feedback?
ha: Kana da wani shawari?

source: Have questions about Common Voice? Ideas for improvements or feedback about a specific language? Join us on our <discourseLink>Discourse forum</discourseLink> and let us know.
ha: Shin akwai tambayoyi game da Common Voice? Ra'ayoyi don ingantawa ko ra'ayoyi game da takamaiman yare? Kasance tare damu a dandalin mu na <discourseLink> Discourse forum </discourseLink> kuma bari mu sani.

source: Have you read our Terms?
ha: Ka karanta ƙa'idojinmu?

source: Having an account is not required to contribute, though it is helpful.
ha: Kasancewa da asusu ba'a bukata domin bada gudumawa, ko da yake yana taimako.

source: Having a profile is not required to contribute though it is helpful
ha: Bada gudummawarka ba sai kana da profile ba, duk da dai yana da amfani in kana dashi.

source: Hebrew
ha: Ibrananci

source: Help
ha: Taimako

source: Help Common Voice reach { $hours } hours in a language with a personal goal
ha: Taimaka wa Common Voice kaiwa { $hours } awannia cikin yaren dake da buri na kai

source: Help create Common Voice’s first target segment in { $locale }
ha: Taimaka wajan ƙirƙirar ɓangaren farko na Common Voice a cikin { $locale }

source: Help reach { $hours } hours in { $language } with a personal goal
ha: Taimaka ya kai { $hours } awanni a cikin { $language } tare da burin kai

source: Help teach machines how real people speak, donate your voice at { $link }
ha: Taimaka don koyar da injuna yadda mutane suke magana, taimaka da muryarka a { $link }

source: Help us build a community around voice technology, stay in touch via email.
ha: Taimaka mana gina al'umma game da fasahar murya, kasance tare da mu ta imel.

source: Help us build a high quality, publicly open dataset
ha: Taimaka mana wajen gina dataset mai inganci, kuma kyauta ga jama'a.

source: Help us find more voices, share your goal
ha: Taimaka mana samun ƙarin muryoyi, raba burinku ku

source: Help us find others to donate their voice!
ha: Taimaka mana mu sami wasu don su ba da gudummawar muryarsu!

source: Help us get to { $goal }
ha: Taimaka mu je zuwa { $goal }

source: Help us validate sentences!
ha: Taimaka mana mu inganta jumla!

source: Help us validate voices
ha: Taimaka mana mu tantance muryoyi

source: Hidden
ha: An ɓoye

source: Hill Mari
ha: Yaren Hill Mari

source: Hindi
ha: Indiyanci

source: Hours Recorded
ha: Awannin da aka ɗauka

source: Hours Validated
ha: Awannin da aka tantance

source: { $hours } validated hours so far!
ha: Awannin da aka tantance kawo yanzu!

source: How ?
ha: Ta yaya?

source: How can I get the Common Voice data?
ha: Ta yaya zan iya samun bayanan Common Voice ?

source: How does Common Voice calculate hours?
ha: Ta yaya Common Voice yake auna sa'o'i?

source: How does it work?
ha: Yaya ya ke aiki?

source: How do you ensure anonymity and privacy of the people who donated their voices?
ha: Ta yaya kake tabbatar da rashin suna da sirrin mutanen da suka ba da gudummawar muryoyinsu?

source: Hungarian
ha: Hungoriyanci

source: I agree
ha: Na yarda

source: I am a non-native speaker and I speak with an accent, do you still want my voice?
ha: Ni ba dan asalin gida bane kuma ina magana da lafazi, har yanzu kuna son muryata?

source: Icelandic
ha: Yaren Icelandic

source: I'd like to receive emails such as goal reminders, my progress updates and newsletters about Common Voice.
ha: Ina son karɓar saƙonnin imel kan tunatarwa akan abinda na ke son cimmawa, ko ci gabana ko kuma labarai a kan Common Voice.

source: I do not agree
ha: Ban yarda ba

source: I just created a personal goal for voice donation to #CommonVoice -- join me and help teach machines how real people speak { $link }
ha: Kawai na ƙirƙiri wata manufa ta kashin kaina don ba da gudummawar murya ga #CommonVoice - ku kasance tare da ni ku taimaka koya wa injina yadda mutane na ainihi suke magana { $link }

source: I’m afraid I don’t know what you’re looking for.
ha: Ina jin tsoro ban san abin da kake nema ba.

source: I'm okay with you handling this info as you explain in Mozilla's <privacyLink>Privacy Policy</privacyLink>
ha: Na gamsu da rikon da kayi ma wannan labari kaman yadda kake bayyana a Mozilla <privacyLink>sirri tsari</privacyLink>

source: * Indicates required field
ha: * Yana nuna cewa wajibi ne ka ciƙe gurbin

source: Indonesian
ha: Yaren Indonisia

source: In Progress
ha: Yana cigaba

source: Interested in learning more and contributing to the project?
ha: Kana sha'awar ƙarin koyo da bayar da gudummawa ga aikin?

source: Interlingua
ha: Yaren Interlingua

source: Irish
ha: Yaren Irish

source: Is my account information public?
ha: Shin bayanan asusuna a buɗe suke?

source: Is the clip valid?
ha: Shin naɗin yana da kyau?

source: Is the goal of Common Voice to build a voice assistant?
ha: Shin manufar gina Common Voice shine domin gina maƙallin murya?

source: Italian
ha: Italiyanci
